"""
Selenium - open-source проект, который предназначен для автоматизации веб-приложений.

Состоит из различных компонентов:

- Selenium WebDriver
- Selenium Grid
- Selenium Server
- Selenium IDE
- и т.п.

Содержит ряд драйверов браузера и клиентских библиотек для ЯП.

End-to-end тестирование - это вид тестирования, при котором компьютер максимально близко к реальности эмулирует
поведение пользователя.

Selenium WebDriver - это программная библиотека для управления браузерами. По своей сути универсальный интерфейс,
который позволяет манипулировать разными браузерами напрямую из кода на ЯП (браузер будет выполнять одинаковые действия,
неважно из библиотеки какого именно языка программирования эти методы будут вы→ званы). Универсальность позволяет
запускать тесты на разных браузерах.

WebDriver - признан стандартным протоколом для взаимодействия с браузером.

habr статья - Что такое Selenium WebDriver? - https://habr.com/ru/post/152971/
habr статья - Что такое Selenium? - https://habr.com/ru/post/152653/

"""